Revit 2027 API
AdaptiveComponentInstanceUtils.IsAdaptiveFamilySymbol Method
 Verifies if a FamilySymbol is a valid Adaptive Family Symbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAdaptiveFamilySymbol(
	FamilySymbol famSymb
)
Public Shared Function IsAdaptiveFamilySymbol (
	famSymb As FamilySymbol
) As Boolean
public:
static bool IsAdaptiveFamilySymbol(
	FamilySymbol^ famSymb
)
static member IsAdaptiveFamilySymbol :
        famSymb : FamilySymbol -> bool
Parameters
famSymb FamilySymbol
 The FamilySymbol
Return Value
Boolean
 True if the FamilySymbol is a valid Adaptive Family Symbol.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace